In [2]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 0.50013573, -0.49367615,  1.31880824],
       [-1.45379103,  0.00936744, -1.5188822 ],
       [ 1.26836021,  0.08484398, -2.95250702],
       [ 0.19259552,  1.00818533,  1.6115338 ]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  0.500136 -0.493676  1.318808
1 -1.453791  0.009367 -1.518882
2  1.268360  0.084844 -2.952507
3  0.192596  1.008185  1.611534

In [7]:
dataFrame[0]

0    0.500136
1   -1.453791
2    1.268360
3    0.192596
Name: 0, dtype: float64

In [8]:
newDataFrame = pd.DataFrame(data,index=["Mert","Elif","Melek","Mustafa"],columns = ["Price","Age","Hour"])

In [9]:
newDataFrame

            Price       Age      Hour
Mert     0.500136 -0.493676  1.318808
Elif    -1.453791  0.009367 -1.518882
Melek    1.268360  0.084844 -2.952507
Mustafa  0.192596  1.008185  1.611534

In [10]:
newDataFrame["Age"]

Mert      -0.493676
Elif       0.009367
Melek      0.084844
Mustafa    1.008185
Name: Age, dtype: float64

In [11]:
newDataFrame[["Price","Age"]]

            Price       Age
Mert     0.500136 -0.493676
Elif    -1.453791  0.009367
Melek    1.268360  0.084844
Mustafa  0.192596  1.008185

In [12]:
newDataFrame.loc["Mert"]

Price    0.500136
Age     -0.493676
Hour     1.318808
Name: Mert, dtype: float64

In [13]:
newDataFrame.iloc[1]

Price   -1.453791
Age      0.009367
Hour    -1.518882
Name: Elif, dtype: float64

## Index

In [14]:
newDataFrame["Total"] = newDataFrame["Age"] * newDataFrame["Hour"]

In [15]:
newDataFrame

            Price       Age      Hour     Total
Mert     0.500136 -0.493676  1.318808 -0.651064
Elif    -1.453791  0.009367 -1.518882 -0.014228
Melek    1.268360  0.084844 -2.952507 -0.250502
Mustafa  0.192596  1.008185  1.611534  1.624725

In [16]:
newDataFrame.drop("Total", axis = 1)

            Price       Age      Hour
Mert     0.500136 -0.493676  1.318808
Elif    -1.453791  0.009367 -1.518882
Melek    1.268360  0.084844 -2.952507
Mustafa  0.192596  1.008185  1.611534

In [17]:
newDataFrame.drop("Mustafa", axis = 0)

          Price       Age      Hour     Total
Mert   0.500136 -0.493676  1.318808 -0.651064
Elif  -1.453791  0.009367 -1.518882 -0.014228
Melek  1.268360  0.084844 -2.952507 -0.250502

In [18]:
newDataFrame.drop("Total", axis = 1, inplace = True)

In [19]:
newDataFrame

            Price       Age      Hour
Mert     0.500136 -0.493676  1.318808
Elif    -1.453791  0.009367 -1.518882
Melek    1.268360  0.084844 -2.952507
Mustafa  0.192596  1.008185  1.611534

In [20]:
newDataFrame.loc["Mert"]["Age"]

-0.49367614973621643

In [21]:
newDataFrame.loc["Mert","Age"]

-0.49367614973621643

In [22]:
booleanFrame = newDataFrame < 0

In [23]:
booleanFrame

         Price    Age   Hour
Mert     False   True  False
Elif      True  False   True
Melek    False  False   True
Mustafa  False  False  False

In [24]:
newDataFrame[booleanFrame]

            Price       Age      Hour
Mert          NaN -0.493676       NaN
Elif    -1.453791       NaN -1.518882
Melek         NaN       NaN -2.952507
Mustafa       NaN       NaN       NaN

In [25]:
newDataFrame[newDataFrame < 0]

            Price       Age      Hour
Mert          NaN -0.493676       NaN
Elif    -1.453791       NaN -1.518882
Melek         NaN       NaN -2.952507
Mustafa       NaN       NaN       NaN

In [26]:
newDataFrame[newDataFrame["Age"] > 0]

            Price       Age      Hour
Elif    -1.453791  0.009367 -1.518882
Melek    1.268360  0.084844 -2.952507
Mustafa  0.192596  1.008185  1.611534

In [27]:
newDataFrame.reset_index()

     index     Price       Age      Hour
0     Mert  0.500136 -0.493676  1.318808
1     Elif -1.453791  0.009367 -1.518882
2    Melek  1.268360  0.084844 -2.952507
3  Mustafa  0.192596  1.008185  1.611534

In [28]:
newIndexList = ["At", "Me", "Di", "Bu"]

In [29]:
newDataFrame["New Index"] = newIndexList

In [30]:
newDataFrame

            Price       Age      Hour New Index
Mert     0.500136 -0.493676  1.318808        At
Elif    -1.453791  0.009367 -1.518882        Me
Melek    1.268360  0.084844 -2.952507        Di
Mustafa  0.192596  1.008185  1.611534        Bu

In [31]:
newDataFrame.set_index("New Index")

              Price       Age      Hour
New Index
At         0.500136 -0.493676  1.318808
Me        -1.453791  0.009367 -1.518882
Di         1.268360  0.084844 -2.952507
Bu         0.192596  1.008185  1.611534

In [32]:
newDataFrame

            Price       Age      Hour New Index
Mert     0.500136 -0.493676  1.318808        At
Elif    -1.453791  0.009367 -1.518882        Me
Melek    1.268360  0.084844 -2.952507        Di
Mustafa  0.192596  1.008185  1.611534        Bu

In [33]:
newDataFrame.set_index("New Index", inplace = True)

In [34]:
newDataFrame

              Price       Age      Hour
New Index
At         0.500136 -0.493676  1.318808
Me        -1.453791  0.009367 -1.518882
Di         1.268360  0.084844 -2.952507
Bu         0.192596  1.008185  1.611534

In [36]:
newDataFrame.loc["Me"]

Price   -1.453791
Age      0.009367
Hour    -1.518882
Name: Me, dtype: float64

## Multi Index

In [37]:
firstIndex = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [38]:
secondIndex = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [39]:
joinedIndex = list(zip(firstIndex, secondIndex))

In [40]:
joinedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [41]:
joinedIndex = pd.MultiIndex.from_tuples(joinedIndex)

In [42]:
joinedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [46]:
myCartoonList = [[40, "A"], [10, "B"], [20, "C"], [11, "F"], [4, "D"], [8, "G"]]

In [47]:
cartoonNumpyArray = np.array(myCartoonList)

In [52]:
cartoonDataFrame = pd.DataFrame(cartoonNumpyArray, index = joinedIndex, columns = ["Age", "Job"])

In [53]:
cartoonDataFrame

                   Age Job
Simpson    Homer    40   A
           Bart     10   B
           Marge    20   C
South Park Cartman  11   F
           Kenny     4   D
           Kyle      8   G

In [54]:
cartoonDataFrame.loc["Simpson"]

      Age Job
Homer  40   A
Bart   10   B
Marge  20   C

In [57]:
cartoonDataFrame.loc["South Park"].loc["Kenny"]

Age    4
Job    D
Name: Kenny, dtype: object